package com.aier.speech.recognizer.bean;

import java.util.List;

public class MapDataResult {

    @Override
    public String toString() {
        return "MapDataResult{" +
                "error_code=" + error_code +
                ", error_msg='" + error_msg + '\'' +
                ", data=" + data +
                '}';
    }

    /**
     * error_code : 0
     * error_msg : 获取成功!
     * data : {"list":[{"id":59,"title":"中共江西曼妮芬服装有限公司支部委员会","address":"江西省赣州市经济技术开发区金岭大道曼妮芬工业园","lng":"114.8645992051","lat":"25.8453141267"},{"id":58,"title":"中共江西亚美达科技有限公司支部委员会","address":"赣州市黄金开发区曼妮芬路","lng":"114.8614537508","lat":"25.8509062083"},{"id":57,"title":"中共赣州华坚国际鞋城有限公司总支部委员会","address":"江西省赣州市黄金开发区赣南工业园内","lng":"114.9012152784","lat":"25.8522535310"},{"id":56,"title":"中共赣州市绿野包装有限公司支部委员会","address":"江西省赣州经济技术开发区工业三路东南侧（黄金大道北与天赋路交汇处）","lng":"114.8782943778","lat":"25.8719194026"},{"id":55,"title":"中共江西客家彩印包装有限公司支部委员会","address":"江西省赣州市赣州经济技术开发区金龙路13号","lng":"114.8551589102","lat":"25.8580082693"},{"id":54,"title":"中共江西省贵竹发展有限公司支部委员会","address":"江西省赣州市赣州经济开发区华坚中路东侧","lng":"114.9038742880","lat":"25.8489677523"},{"id":53,"title":"中共赣州赣阀阀门有限公司支部委员会","address":"江西省赣州市章贡区金坪工业大道26号","lng":"114.9058090000","lat":"25.8470140000"},{"id":52,"title":"中共江西韶钢元和实业有限公司支部委员会","address":"江西省赣州开发区金岭西路南侧、工业四路西侧综合楼","lng":"114.8612010000","lat":"25.8536630000"},{"id":51,"title":"中共赣州国际汽车城支部委员会","address":" 赣州市章贡区客家大道181号","lng":"114.9223250000","lat":"25.8395230000"},{"id":50,"title":"中共赣州华欧电子有限公司支部委员会","address":"赣州市迎宾大道63号","lng":"114.8792633588","lat":"25.8524342057"},{"id":49,"title":"中共赣州力昌表业有限公司支部委员会","address":"江西省赣州市赣州开发区金潭大道26号","lng":"114.8955752784","lat":"25.8589935310"},{"id":48,"title":"中共研创光电科技（赣州）有限公司支部委员会","address":"赣州开发区工业二路香港工业园北区高新技术产业孵化基地标准厂房5栋","lng":"114.8770763043","lat":"25.8684766461"},{"id":47,"title":"中共赣州立德电子有限公司支部委员会","address":"赣州市经济技术开发区赣州综合保税区岗边大道1号","lng":"114.8248011650","lat":"25.8541005390"},{"id":46,"title":"中共赣州市同兴达电子科技有限公司支部委员会","address":"赣州市经济技术开发区纬一路168号","lng":"114.8920679690","lat":"25.8731208975"},{"id":45,"title":"中共赣州金信诺电缆技术有限公司支部委员会","address":"赣州经济技术开发区香港工业园北区金龙路9号（杨山路与金龙路交汇处）","lng":"114.8600879102","lat":"25.8579742693"},{"id":44,"title":"中共立昌科技（赣州）有限公司支部委员会","address":"江西省赣州市赣州经济技术开发区香港工业园经三路9号","lng":"114.8860407072","lat":"25.8873717140"},{"id":43,"title":"中共江西蓝天路之友环卫设备科技有限公司支部委员会","address":"江西省赣州开发区宝福路以西工业一路以东","lng":"114.8844660367","lat":"25.8604609461"},{"id":42,"title":"中共赣州五环机器有限责任公司支部委员会","address":"江西省赣州经济技术开发区金岭路南侧、工业二路西侧","lng":"114.9061342880","lat":"25.8502947523"},{"id":41,"title":"中共孚能科技（赣州）有限公司支部委员会","address":"江西赣州赣州开发区金岭西大道底端栖凤山路","lng":"114.8526037508","lat":"25.8452162083"},{"id":40,"title":"中共赣州南北大市场支部委员会","address":"江西省赣州市章贡区金东路","lng":"114.9155510000","lat":"25.8416230000"},{"id":39,"title":"中共江西博鑫酒店有限公司支部委员会","address":"江西省赣州开发区金东北路88号","lng":"114.9179830000","lat":"25.8571570000"},{"id":38,"title":"中共赣州国力赣源汽车贸易有限公司支部委员会","address":"赣州市经济技术开发区迎宾大道43号","lng":"114.8915210000","lat":"25.8519170000"},{"id":37,"title":"中共赣州市兴达利汽车贸易有限公司支部委员会","address":"赣州市章贡区经济技术开发区迎宾大道金潭路4S精品一条街","lng":"114.8938220000","lat":"25.8492850000"},{"id":36,"title":"中共赣州金涛汽车销售服务有限公司支部委员会","address":" 赣州市章贡区金潭大道7号","lng":"114.8936230000","lat":"25.8496800000,114.8936230000"},{"id":35,"title":"中共赣州运通汽车技术服务有限公司支部委员会","address":"赣州市经济技术开发区迎宾大道49号","lng":"114.8862110000","lat":"25.8521800000"},{"id":34,"title":"中共江西坚强连锁百货有限公司支部委员会","address":"工业一路与金岭路交叉口西150米","lng":"114.8804180000","lat":"25.8456270000"},{"id":33,"title":"中共赣州井然贸易有限公司支部委员会","address":"江西省赣州市章贡区金东路37号","lng":"114.9158330000","lat":"25.8512110000"},{"id":32,"title":"中共江西慧通力合信息技术有限公司支部委员会","address":"赣州市经济技术开发区国际企业中心6号楼六楼","lng":"114.9022400000","lat":"25.8658230000"},{"id":31,"title":"中共家家乐实业有限公司支部委员会","address":"江西省赣州市章贡区赣通大道110","lng":"114.8924780000","lat":"25.8781300000"},{"id":30,"title":"中共江西东坚农业有限公司支部委员会","address":"赣州市经开区纬十路1号（大田精密公交站台后侧东坚米业）","lng":"114.8829487072","lat":"25.8824207140"},{"id":29,"title":"中共赣州朱师傅预混饲料有限公司支部委员会","address":"赣州开发区金龙路20号","lng":"114.8902380367","lat":"25.8578379461"},{"id":28,"title":"中共江西自然成食品有限公司支部委员会","address":"江西省赣州市赣州开发区香港工业园北区工业一路北段西南侧、经一路西侧","lng":"114.8778643778","lat":"25.8772494026"},{"id":27,"title":"中共江西宝宝仔饲料有限公司支部委员会","address":"赣州经济技术开发区工业园金潭大道西侧","lng":"114.8948752784","lat":"25.8584835310"},{"id":26,"title":"中共播恩生物技术股份有限公司支部委员会","address":"江西省赣州经济技术开发区迎宾大道中段","lng":"114.8825224263","lat":"25.8530385753"},{"id":25,"title":"中共赣州美园畜牧有限公司支部委员会","address":"江西省赣州市黄金岭开发区杨梅村","lng":"114.8734463588","lat":"25.8509502057"},{"id":24,"title":"中共赣州汇强机械制造有限公司支部委员会","address":"赣州市黄金开发区工业二路金坪路14号","lng":"114.8756287071","lat":"25.8495355156"},{"id":23,"title":"中共江西四海生物科技有限公司支部委员会","address":"江西省赣州经济技术开发区金岭西路101号","lng":"114.8564237508","lat":"25.8453862083"},{"id":22,"title":"中共江西厚德医药有限公司支部委员会","address":"江西省赣州市赣州经济技术开发区金坪路18号","lng":"114.8831238498","lat":"25.8490295377"},{"id":21,"title":"中共赣州润泰药业有限公司支部委员会","address":"赣州市章贡区赣州开发区金潭大道赣通大道口","lng":"114.8950179690","lat":"25.8788208975"},{"id":20,"title":"中共九鼎赣饶中介服务咨询有限公司支部委员会 ","address":"江西省赣州市经济技术开发区香江大道国际企业中心A2栋","lng":"114.9032240000","lat":"25.8648520000"},{"id":19,"title":"中共金宁保安服务有限公司支部委员会","address":"赣州市章贡区宝强名车维修专家3楼","lng":"114.9031110000","lat":"25.8386500000"},{"id":18,"title":"中共赣州幸福故事餐饮管理有限公司支部委员会 ","address":"江西省赣州市赣州经济技术开发区迎宾大道光华职校内","lng":"114.8570940000","lat":"25.8526500000"},{"id":17,"title":"中共赣州鑫昌宏实业有限公司支部委员会","address":"江西省赣州市经济技术开发区赣南工业园迎宾大道","lng":"114.915027000","lat":"25.8516480000"},{"id":16,"title":"中共鑫业集团公司支部委员会","address":"江西省赣州市经济技术开发区迎宾大道8号","lng":"114.9135450000","lat":"25.8527710000"},{"id":15,"title":"中共赣州瑞康混凝土有限公司支部委员会","address":"江西省赣州市经济技术开发区工业园工业四路","lng":"114.8607540000","lat":"25.8650430000"},{"id":14,"title":"中共江西龙峰建设集团有限公司支部委员会","address":"赣州市迎宾大道67号 ","lng":"114.8768130000","lat":"25.8523420000"},{"id":13,"title":"中共江西富盛德建筑工程有限公司支部委员会","address":"江西省赣州市经济技术开发区香江大道北侧华坚北路西侧赣州国际企业中心A1#楼4层1#办公室","lng":"114.9033990000","lat":"25.8652470000"},{"id":12,"title":"中共赣州威能建设工程有限公司支部委员会","address":"江西省赣州市赣州经济技术开发区华坚北路西侧、纬一路南侧赣州建筑业总部大楼317#办公室","lng":"114.8988014460","lat":"25.8659863671"},{"id":11,"title":"中共江西省龙源工程项目管理有限公司支部委员会","address":"赣州市赞贤路紫金广场A栋1301#写字间","lng":"114.9125970000","lat":"25.8279850000"},{"id":10,"title":"中共赣州市钜磁科技有限公司支部委员会","address":"赣州开发区赣通大道北与宝福路东交汇处","lng":"114.8909771731","lat":"25.8773825299"},{"id":9,"title":"中共赣州海盛硬质合金有限公司支部委员会","address":"江西省赣州市赣州开发区纬一路172号","lng":"114.8890491731","lat":"25.8731035299"},{"id":8,"title":"中共赣州富尔特电子股份有限公司支部委员会","address":"赣州开发区曼妮芬路5号","lng":"114.8604437508","lat":"25.8478262083"},{"id":7,"title":"中共赣州通诚磁材有限公司支部委员会","address":"江西省赣州市开发区宝福路9号","lng":"114.8871938498","lat":"25.8501295377"},{"id":6,"title":"中共赣州晶环稀土新材料有限公司支部委员会","address":"江西省 赣州市 章贡区 经济开发区95号","lng":"114.8581679102","lat":"25.8527342693"},{"id":5,"title":"中共赣州嘉通新材料有限公司支部委员会","address":"赣州市经济开发区章贡王路与金龙路交接处（金龙路5号）","lng":"114.8744733588","lat":"25.8576642057"},{"id":4,"title":"中共赣州市东磁稀土有限公司支部委员会","address":"赣州市经济技术开发区金龙路北侧（与杨山路交界处）","lng":"114.8607479102","lat":"25.8587642693"},{"id":3,"title":"中共京瓷精密工具（赣州）有限公司支部委员会","address":"赣州经济技术开发区纬一路172号","lng":"114.8888451731","lat":"25.8740265299"},{"id":2,"title":"中共江西金力永磁科技股份有限公司支部委员会","address":"中国江西省赣州市经济技术开发区金岭西路81号","lng":"114.8760087071","lat":"25.8451455156"},{"id":1,"title":"中共赣州澳克泰工具技术有限公司支部委员会","address":"中国江西省赣州市经济技术开发区工业三路","lng":"114.8656763401","lat":"25.8616792398"}]}
     */

    private int error_code;
    private String error_msg;
    private DataBean data;

    public int getError_code() {
        return error_code;
    }

    public void setError_code(int error_code) {
        this.error_code = error_code;
    }

    public String getError_msg() {
        return error_msg;
    }

    public void setError_msg(String error_msg) {
        this.error_msg = error_msg;
    }

    public DataBean getData() {
        return data;
    }

    public void setData(DataBean data) {
        this.data = data;
    }

    public static class DataBean {
        private List<ListBean> list;

        public List<ListBean> getList() {
            return list;
        }

        public void setList(List<ListBean> list) {
            this.list = list;
        }

        public static class ListBean {
            /**
             * id : 59
             * title : 中共江西曼妮芬服装有限公司支部委员会
             * address : 江西省赣州市经济技术开发区金岭大道曼妮芬工业园
             * lng : 114.8645992051
             * lat : 25.8453141267
             */

            private int id;
            private String title;
            private String address;
            private String lng;
            private String lat;

            public int getId() {
                return id;
            }

            public void setId(int id) {
                this.id = id;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }

            public String getAddress() {
                return address;
            }

            public void setAddress(String address) {
                this.address = address;
            }

            public String getLng() {
                return lng;
            }

            public void setLng(String lng) {
                this.lng = lng;
            }

            public String getLat() {
                return lat;
            }

            public void setLat(String lat) {
                this.lat = lat;
            }

            @Override
            public String toString() {
                return "ListBean{" +
                        "id=" + id +
                        ", title='" + title + '\'' +
                        ", address='" + address + '\'' +
                        ", lng='" + lng + '\'' +
                        ", lat='" + lat + '\'' +
                        '}';
            }
        }
    }
}
